Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: These attribute arguments are enclosed in parentheses, and their format is defined by the attribute they belong to.
ja: これらの属性引数は丸括弧に囲まれます、そして、それらの形式はそれらが属している属性によって定義されます。

source: These declarations can include both stored and computed properties, instance methods, type methods, initializers, a single deinitializer, subscripts, type aliases, and even other class, structure, and enumeration declarations.
ja: これらの宣言は、格納または計算プロパティの双方、インスタンスメソッド、型メソッド、イニシャライザ、１つだけのデイニシャライザ、添え字、型エイリアス、そして他のクラス、構造体、および列挙宣言さえも含むことができます。

source: These declarations can include both stored and computed properties, type properties, instance methods, type methods, initializers, subscripts, type aliases, and even other structure, class, and enumeration declarations.
ja: これらの宣言は、格納または計算プロパティの双方、型プロパティ、インスタンスメソッド、型メソッド、イニシャライザ、添え字、型エイリアス、そして他の構造体、クラス、および列挙宣言さえも含むことができます。

source: These declarations can include computed properties, computed type properties, instance methods, type methods, initializers, subscript declarations, and even class, structure, and enumeration declarations.
ja: これらの宣言は、計算プロパティ、計算型プロパティ、インスタンスメソッド、型メソッド、イニシャライザ、添え字宣言、そしてクラス、構造体、そして列挙宣言さえも含むことができます。

source: These access levels are relative to the source file in which an entity is defined, and also relative to the module that source file belongs to.
ja: これらのアクセス水準は、ある実在が定義されているソースファイルと関連しています、そのうえに、ソースファイルが属しているモジュールとも関連しています。

source: These actions are described in the following sections.
ja: これらの行いは、以下の節で記述されます。

source: These are custom classes, structures, and enumerations that can work with any type, in a similar way to Array and Dictionary.
ja: これらは、ArrayとDictionaryに類似した方法で、あらゆる型で扱うことができる特注のクラス、構造体、そして列挙があります。

source: These are followed by a check digit to verify that the code has been scanned correctly:
ja: これらの後にコードが正しくスキャンされたことを確認するための１つの「チェック」桁が続きます：

source: These are known as constants, and are much more powerful than constants in C. Constants are used throughout Swift to make code safer and clearer in intent when you work with values that don’t need to change.
ja: これらは定数として知られています、そしてCにおける定数よりずっと強力です。定数は、変わる必要がない値をあなたが扱う時、コードをより安全により明白にする意図でスウィフトを通して使われます。

source: These are known as designated initializers and convenience initializers.
ja: これらは、指定イニシャライザと便宜イニシャライザとして知られています。

source: These are used as the two input values for the provided math function.
ja: これらは提供された数学関数のための２つの入力値として使われます。

source: These arguments begin with one of the following platform or language names:
ja: これらの引数は、以下のプラットホームまたは言語名の１つで始まります。

source: These attributes are conceptually the same as their Objective-C counterparts.
ja: これらの属性は、概念的にそれらのObjective-Cでの対応物と同じものです。

source: These changes are allowed on nonfrozen types, but they break ABI compatibility for frozen types.
ja: これらの変更は、非凍結型の上では許可されます、しかしそれらは凍結型に対するABI互換性を破壊します。

source: These classes expand upon the Person and Residence model from above by adding a Room and Address class, with associated properties, methods, and subscripts.
ja: これらのクラスは、関連するプロパティ、メソッド、そして添え字とともにRoomとAddressクラスを加えることによって、上記のPersonとResidenceモデルを拡張します。

source: These computed properties express that a Double value should be considered as a certain unit of length.
ja: これらの計算プロパティは、Double値が長さの特定の単位とみなされなければならないことを表します。

source: These constants (or variables) can then be referenced in a corresponding where clause and throughout the rest of the code within the scope of the case.
ja: これらの定数（または変数）は、それから対応するwhere節の中で、そしてそのケース節のスコープ内のその他のコードのいたるところで参照されることができます。

source: These constants are used as part of a where clause, to create a dynamic filter.
ja: これらの定数は、where節の一部として動的なフィルタを作成するために使用されます。

source: These function calls don’t violate the restriction because external isn’t one of the parameters of takesTwoFunctions(first:second:).
ja: これらの関数呼び出しは制約に違反しません、なぜならexternalはtakesTwoFunctions(first:second:)のパラメータの１つだからです。

source: These functions and methods are known as rethrowing functions and rethrowing methods.
ja: これらの関数とメソッドは、再スロー関数と再スローメソッドとして知られています。

source: These functions and methods are known as throwing functions and throwing methods.
ja: これらの関数とメソッドはスロー関数およびスローメソッドとして知られます。

source: These functions each take two Int values, and return an Int value, which is the result of performing an appropriate mathematical operation.
ja: これらの関数は、各々２つのInt値をとって、１つのInt値を返します、そしてそれは、適切な数値演算の実行の結果です。

source: These include while loops to perform a task multiple times; if, guard, and switch statements to execute different branches of code based on certain conditions; and statements such as break and continue to transfer the flow of execution to another point in your code.
ja: これらは、ある作業を複数回実行するwhileループ；特定の条件に基づいてコードの異なる分岐を実行するif、guard、およびswitch文；そして実行の流れをあなたのコードの別の地点に移す、breakおよびcontinueのような文を含みます。

source: These include all of the bitwise and bit shifting operators you will be familiar with from C and Objective-C.
ja: これらは、あなたがCとObjective-Cからお馴染みの、ビット単位およびビットシフト演算子の全てを含んでいます。

source: These include enumeration case patterns, optional patterns, expression patterns, and type-casting patterns.
ja: これらは、列挙ケース節パターン、オプショナルパターン、式パターン、および型キャストパターンを含みます。

source: These include the UTF-8 encoding form (which encodes a string as 8-bit code units), the UTF-16 encoding form (which encodes a string as 16-bit code units), and the UTF-32 encoding form (which encodes a string as 32-bit code units).
ja: これらは、UTF-８符号化方式（それは、８ビット符号単位として文字列を符号化します）、UTF-16符号化方式（それは、16ビット符号単位として文字列を符号化します）、そしてUTF-32符号化方式（それは、32ビット符号単位として文字列を符号化します）を含みます。

source: These include wildcard patterns, identifier patterns, and any value binding or tuple patterns containing them.
ja: これらはワイルドカード・パターン、識別子パターン、そしてそれらを含むあらゆる値束縛やタプルパターンを含みます。

source: These initialization options are represented by three custom initializers that are part of the Rect structure’s definition:
ja: これらの初期化オプションは、Rect構造体の定義の一部である３つのあつらえのイニシャライザによって表されます：

source: These initializers can be used to create new Rect instances:
ja: これらのイニシャライザが、新しいRect例をつくるために使われることができます：

source: These integers follow a naming convention similar to C, in that an 8-bit unsigned integer is of type UInt8, and a 32-bit signed integer is of type Int32.
ja: これらの整数は、８ビットの符号なし整数が型UInt8である、そして32ビットの符号つき整数が型Int32であるという点で、Cに似ている命名規則に従います。

source: These keywords are described in the sections below.
ja: これらのキーワードは、以下の節で解説されます。

source: These kinds of closures or functions typically create a temporary value of the same type as the property, tailor that value to represent the desired initial state, and then return that temporary value to be used as the property’s default value.
ja: これらの種類のクロージャまたは関数は、概してプロパティと同じ型の一時的な値をつくって、望み通りの初期状態を表すようにその値を仕立てて、それからその一時的な値がプロパティの省略時の値として使われるように返します。

source: These kinds of loops are best used when the number of iterations is not known before the first iteration begins.
ja: これらの種類のループが最も使われるのは、繰り返しの回数が最初の繰り返しが始まる前にはわからないときです。

source: These kinds of methods are called type methods.
ja: これらの種類のメソッドは、型メソッドと呼ばれています。

source: These kinds of optionals are defined as implicitly unwrapped optionals.
ja: これらの種類のオプショナルは、暗黙的にアンラップされるオプショナルとして定義されます。

source: These kinds of properties are called type properties.
ja: これらの種類のプロパティは、型プロパティと呼ばれています。

source: These methods are marked as mutating, because they need to modify (or mutate) the structure’s items array.
ja: これらのメソッドはmutatingとして印されます、なぜなら、それらが構造体のitems配列を修正する（または変化させる）必要があるためです。

source: These methods are written as part of the protocol’s definition in exactly the same way as for normal instance and type methods, but without curly braces or a method body.
ja: これらのメソッドは、プロトコルの定義の一部として普通のインスタンスおよび型メソッドと正確に同じ方法で書かれます、しかし波括弧またはメソッド本文はありません。

source: These names are valid identifiers within the scope of the closure.
ja: これらの名前は、クロージャのスコープ内で有効な識別子です。

source: These operators all begin with an ampersand (&):
ja: これらの演算子は、全てアンパサンド（&）で始まります：

source: These operators are now used only with String values.
ja: これらの演算子は今ではString値でのみ使用されます。

source: These operators can be used and adopted in your code like any of the predefined operators, and you can even extend existing types to support the custom operators you define.
ja: これらの演算子は、あらかじめ定義された演算子のどれとも同じように、使用されることができ、あなたのコードにおいて取り入れられることができます、そして、あなたはあなたが定義するカスタム演算子をサポートするように既存の型を拡張することさえ可能です。

source: These operators can contain additional dots.
ja: これらの演算子は、さらなるドットを含むことが可能です。

source: These operators have the same associativity and precedence as the logical operators that are used to combine ordinary Boolean expressions.
ja: これらの演算子は、普通のブール式を組み合わせるのに使われる論理演算子と同じ結合性と優先順位を持ちます。

source: These optimizations include:
ja: これらの最適化は、以下を含みます：

source: These options are described later in this chapter.
ja: それらの選択肢は、この章の後刻に記述されます。

source: These overrides ensure that an AutomaticallyNamedDocument instance has an initial name value of "[Untitled]" if the instance is initialized without a name, or if an empty string is passed to the init(name:) initializer:
ja: これらのオーバーライドは、AutomaticallyNamedDocumentインスタンスが、そのインスタンスが名前なしで初期化されるならば、または空の文字列がinit(name:)イニシャライザに渡されるならば、初期name値の"[Untitled]"を持つことを確実にします：

source: These pairings are written within a pair of square braces, separated by commas.
ja: これらの組合せは、一対の角括弧内に書かれて、コンマで区切られます。

source: These properties are read-only computed properties, and so they are expressed without the get keyword, for brevity.
ja: これらのプロパティは、読み出し専用の計算プロパティです、それでそれらは簡潔さのために、getキーワードなしで表わされます。

source: These properties store a value between 0.0 and 1.0 to indicate the amount of red, green, and blue in the color.
ja: これらのプロパティは、0.0と1.0の間の値を格納して、その色における赤、緑、および青の量を示します。

source: These requirements define two different ways for data sources to provide an appropriate increment amount for a Counter instance.
ja: これらの要件は、データ・ソースのためにCounterインスタンスに適切な増加量を用意する２つの異なる方法を定義します。

source: These requirements don’t have to be implemented by types that conform to the protocol.
ja: それらの要件は、そのプロトコルに準拠する型によって実装される必要はありません。

source: These requirements enable the allItemsMatch(_:_:) function to compare the two containers, even if they’re of a different container type.
ja: これらの要件は、allItemsMatch(_:_:)関数に２つのコンテナを比較するのを可能にします、たとえそれらが異なるコンテナ型であるとしてもです。

source: These requirements mean:
ja: これらの要件が意味するのは：

source: These responsibilities are described in Class Inheritance and Initialization below.
ja: これらの責任は、下記のクラス継承と初期化で記述されます。

source: These rules apply even if your subclass adds further convenience initializers.
ja: これらの規則は、たとえあなたのサブクラスが更なる便宜イニシャライザを加えるとしてもあてはまります。

source: These rules are illustrated in the figure below:
ja: これらの規則は、下の図で説明されます：

source: These rules don’t affect how users of your classes create instances of each class.
ja: これらの規則は、あなたのクラスのユーザーが各クラスのインスタンスを作成する方法に影響を及ぼしません。

source: These situations are discussed in the sections below.
ja: これらの状況は、以下の節で議論されます。

source: These statements are indicated by the else keyword.
ja: それらの文は、elseキーワードによって指し示されます。

source: These three capabilities match the requirements of the Container protocol.
ja: これらの３つの能力は、Containerプロトコルの要件に合致します。

source: These three methods have been incorporated into the game logic within the play() method above, and are called when a new game starts, a new turn begins, or the game ends.
ja: これらの３つのメソッドは、上のplay()メソッド内のゲーム論理に組み込まれています、そして、新しいゲームが始まるとき、新しいターンを開始するとき、あるいはこのゲームが終わるとき、呼ばれます。

source: These tokens can’t be overloaded, nor can they be used as custom operators.
ja: これらのトークンは、オーバーロードされることができませんし、それらはあつらえの演算子として使われることもできません。

source: These two classes each store an instance of the other class as a property.
ja: これらの２つのクラスは、それぞれ他のクラスのインスタンスをプロパティとして格納します。

source: These two operators provide a simple and expressive way to check the type of a value or cast a value to a different type.
ja: これらの２つの演算子は、値の型を調べたり、値を異なる型にキャストする（配役する、投げ込む）ための単純で表現豊かな方法を提供します。

source: These two properties are inferred to be of type Int by setting them to an initial integer value of 0.
ja: これらの２つのプロパティは、それらを最初の整数値0に設定することによって型Intであると推論されます。

source: These two statements call the subscript’s setter to set a value of 1.5 in the top right position of the matrix (where row is 0 and column is 1), and 3.2 in the bottom left position (where row is 1 and column is 0):
ja: これらの２つの文は、添え字のセッターを呼び出して、この行列の右上位置（rowが0でcolumnが1のところ）に1.5の値を、そして左下位置（rowが1でcolumnが0のところ）に3.2を設定します：

source: These type parameters act as placeholders that are replaced by actual concrete type arguments when an instance of a generic type is created or a generic function or initializer is called.
ja: これらの型パラメータは、総称体型のインスタンスがつくられる、あるいは、総称体の関数やイニシャライザが呼ばれるとき、実際の具象型引数と取り替えられるプレースホルダの働きをします。

source: These types are not the same as () -> ()—a function that takes no arguments.
ja: これらの型は、() -> () — 引数を取らない関数、と同じではありません。

source: These types are specified in the associated value types tuple, immediately following the name of the case.
ja: これらの型は、ケース節の名前の直後に、それら関連値型のタプルを使って指定されます。

source: These valid tokens form the lowest-level building blocks of the language and are used to describe the rest of the language in subsequent chapters.
ja: これらの公式のトークンは、言語の最も基本的な建物ブロックを形成して、以降の章において言語の残りの部分を記述するために使われます。

source: These values are a high-surrogate value of U+D83D (decimal value 55357) and a low-surrogate value of U+DC36 (decimal value 56374).
ja: これらの値は、前半代用値のU+D83D（10進の値55357）と後半代用値のU+DC36（10進の値56374）です。

source: These values are labeled min and max so that they can be accessed by name when querying the function’s return value.
ja: それらの値は、minおよびmaxとラベルをつけられます、なのでそれらはこの関数の戻り値について問い合わせるときに名前によってアクセスされることが出来ます。

source: These values are represented as optionals.
ja: このような値は、オプショナルであるとして表現されます。

source: These variations on function syntax are discussed below in Function Argument Labels and Parameter Names and Default Parameter Values.
ja: 関数構文上のこれらの差異は、関数の引数ラベルとパラメータ名と省略時のパラメータ値の下で議論されます。

source: They access the same location in memory.
ja: それらがメモリ中の同じ位置にアクセスする。

source: They adopt many features traditionally supported only by classes, such as computed properties to provide additional information about the enumeration’s current value, and instance methods to provide functionality related to the values the enumeration represents.
ja: それらはクラスによってのみ伝統的に支えられる多くの特徴を採用します、例えば列挙の現在の値に関する追加の情報を提供する計算プロパティ、そして、列挙が表す値に関連した機能性を提供するインスタンスメソッドなど。

source: They are prefix if they precede their target (such as -a) and postfix operators if they follow their target (such as b!).
ja: それらは、それがその目標に先行するならば接頭辞（例えば-a）、それがその目標の後に続くならば接尾辞演算子です（例えばb!）。

source: They are guaranteed to be initialized only once, even when accessed by multiple threads simultaneously, and they do not need to be marked with the lazy modifier.
ja: それらは、ただ１度だけ初期化されることを保証されます、複数のスレッドによって同時にアクセスされる場合でさえもです、そしてそれらはlazy修飾子で印されることを必要としません。

source: They are not called while a class is setting its own properties, before the superclass initializer has been called.
ja: それらは、スーパークラスイニシャライザが呼び出され終わる前、あるクラスがそれ自身のプロパティを設定している間には呼び出されません。

source: They are often used in low-level programming, such as graphics programming and device driver creation.
ja: それらが、低階層のプログラミング、例えばグラフィックス・プログラミングやデバイスドライバー作成において、しばしば使われます。

source: They are stored by subtracting their absolute value from 2 to the power of n, where n is the number of value bits.
ja: それらは、2のn乗からそれらの絶対値を減ずることによって格納されます、そこで、nは値ビットの数です。

source: They can be used as expressions on their own, and they can be combined with other tokens to make prefix expressions, binary expressions, and postfix expressions.
ja: それらはそれら自身で式として使われることができます、そしてそれらは接頭辞式、二項式、そして接尾辞式を作るために別のトークンと組み合わされることができます。

source: They can’t be added together directly, because they’re not of the same type.
ja: それらは直接にひとつに加算されることができません、それらが同じ型でないためです。

source: They can’t be adopted by structures or enumerations.
ja: それは構造体や列挙によって採用されることはできません。

source: They continue to be a Circle, a Country and an Animal.
ja: それらは、Circle、Country、そしてAnimalであり続けます。

source: They could prefer one mark every 5 minutes instead.
ja: 彼らは、代わりに5分毎に１つの印を選ぶことができます。

source: They have the following form:
ja: これらは以下の形式を持ちます：

source: They must always explicitly declare their adoption of the protocol.
ja: それらは、常に明示的にそのプロトコルについてそれらが採用することを宣言しなければなりません。

source: They must always have a number (or hexadecimal number) on both sides of the decimal point.
ja: それらは、常に小数点の両側で数（または16進の数）を持たなければなりません。

source: They must have a set value before first use.
ja: それは最初に使用される前に値を設定される必要があります。

source: They support the functionality of those instances, either by providing ways to access and modify instance properties, or by providing functionality related to the instance’s purpose.
ja: それは、そういったもののインスタンスの機能性を、インスタンスプロパティにアクセスしたり修正したりする方法を提供することで、またはインスタンスの目的と関連がある機能性を提供することでのどちらかで支えます。

source: They themselves don’t describe a specific resolution or video mode.
ja: それらはそれら自体で、特定の解像度またはビデオ・モードを記述しません。

source: They’re both optional, after all.
ja: 結局、それらは両方ともオプショナルです。

source: They’re not suited to the creation of complex data structures.
ja: それらは、複雑なデータ構造物の作成には適していません。

source: Think of it as meaning “they associate with the expression to their left,” or “they associate with the expression to their right.”
ja: それは「それらは、式をそれらの左と結びつける」あるいは「それらは、式をそれらの右と結びつける」を意味すると考えてください。

source: Think of this as adding implicit parentheses around these parts of the expression, starting from their left:
ja: これを、これらの式部分のまわりに、暗黙の括弧をそれらの左から開始して加えることと考えてみてください：

source: This switch statement does not have a default case.
ja: このswitch文にはdefaultケース節がない点に注意してください。

source: This Player instance is stored in an optional Player variable called playerOne.
ja: このPlayerインスタンスは、playerOneと呼ばれるオプショナルのPlayer変数に格納されます。

source: This default case does not need to perform any action, and so it is written with a single break statement as its body.
ja: このdefaultケース節はいかなる動作も実行する必要がありません、なのでそれはその本文としてbreak文ひとつだけを書かれます。

source: This action ensures that signed integers have the same sign after they are shifted to the right, and is known as an arithmetic shift.
ja: この動作は、符号つき整数が、それが右へシフトされた後に同じサインを持つことを確実にします、そして算術シフトとして知られています。

source: This additional information is called an associated value, and it varies each time you use that case as a value in your code.
ja: この追加的情報は、関連値と呼ばれます、そしてそれは、あなたがそのケース節をある値としてあなたのコードにおいて使うたびに変化します。

source: This aids code consistency and interoperability.
ja: これは、コードの整合性と相互運用性を支援します。

source: This allows you to define behavior on protocols themselves, rather than in each type’s individual conformance or in a global function.
ja: これはあなたに、それぞれの型の個々の準拠においてまたはグローバル関数においてではなく、プロトコルそれ自体に振る舞いを定義することを可能にします。

source: This also means that if you assign a closure to two different constants or variables, both of those constants or variables refer to the same closure.
ja: これはまた、あなたがクロージャを２つの異なる定数または変数に代入するならば、それらの定数または変数の両方とも同じクロージャに言及することを意味するでしょう。

source: This approach assumes that the method’s caller knows there’s a special value to test against and remembers to check for it.
ja: このアプローチは、メソッドの呼び出し側が試験するべき特別な値があるのを知っていて、それについて調べるのを忘れないでいると仮定します。

source: This approach avoids accidental fallthrough from one case to another and makes for safer code that is clearer in its intent.
ja: この取り組み方は、１つのケース節から他のものへの思いがけない抜け落ちを防止してより安全なコード、その意図するところがより明白であること、に寄与します。

source: This approach avoids confusion about how the value is accessed in different contexts and simplifies the property’s declaration into a single, definitive statement.
ja: この取り組み方は、値が異なる文脈においてアクセスされる方法についての混乱を避け、プロパティの宣言をただ１つの、決定的な文に単純化します。

source: This approach is different from string mutation in Objective-C and Cocoa, where you choose between two classes (NSString and NSMutableString) to indicate whether a string can be mutated.
ja: この取り組みは、Objective-Cとココアでの文字列変化と異なります、そこでは、あなたは文字列が変化することができるかどうか示すために、２つのクラス（NSStringとNSMutableString）のどちらかを選びます。

source: This approach is known as a logical shift.
ja: このやり方は、論理シフトとして知られています。

source: This approach to defining a JoinedShape<T: Shape, U: Shape> structure that joins two shapes together vertically, like the code below shows, results in types like JoinedShape<FlippedShape<Triangle>, Triangle> from joining a flipped triangle with another triangle.
ja: ２つの形状を一緒に垂直につなぐJoinedShape<T: Shape, U: Shape>構造体を定義するこの取り組みは、下のコードが示すように、裏返した三角を別の三角とつなぐことからJoinedShape<FlippedShape<Triangle>, Triangle>のような型という結果になります。

source: This argument can’t be used when specifying Swift version availability.
ja: この引数は、スウィフトバージョン利用可能性を指定する時に使われることはできません。

source: This assumption is demonstrated by the use of count (rather than self.count) inside the three instance methods for Counter.
ja: この仮定は、Counterのための３つのインスタンスメソッド内部での（self.countではなく）countの使用によって示されます。

source: This attribute can’t be applied to declarations that are nested inside functions or to fileprivate or private declarations.
ja: この属性は、関数の内部に入れ子にされる宣言に、またはfileprivateやprivate宣言に適用できません。

source: This attribute causes the property’s setter to be synthesized with a copy of the property’s value—returned by the copyWithZone(_:) method—instead of the value of the property itself.
ja: この属性は、プロパティのセッターがそのプロパティの値のコピー ― copyWithZone(_:)メソッドによって返されるもの ― を使って合成されるようにします、プロパティそれ自体の値ではなく。

source: This attribute is allowed only when compiling in library evolution mode.
ja: この属性は、ライブラリ進化モードでコンパイルしている場合にのみ許可されます。

source: This attribute is inferred for any class that inherits from NSManagedObject.
ja: この属性は、NSManagedObjectから継承されるあらゆるクラスに対して伴われます。

source: This avoids implicitly conforming to the parent protocol twice with different requirements.
ja: これは、その親プロトコルに対する異なる要件での二重の暗黙的準拠を回避します。

source: This base class declares a stored property called numberOfWheels, with a default Int value of 0.
ja: この基盤クラスはnumberOfWheelsと呼ばれる格納プロパティを、省略時の値としてInt値0を使って、宣言します。

source: This base class defines a stored property called currentSpeed, with a default value of 0.0 (inferring a property type of Double).
ja: この基盤クラスは、currentSpeedと呼ばれる格納プロパティを定義します、それは0.0の省略時の値を持ちます（Doubleの型のプロパティと推論されます）。

source: This behavior can be used to match and ignore one or more cases in a switch statement.
ja: この挙動は、switch文の１つ以上のケース節を適合してから無視することのために使われることができます。

source: This behavior gives extra safety when you work with numbers that are too large or too small.
ja: この挙動は、あまりに大きいかあまりに小さい数をあなたが扱うとき、追加の安全を与えます。

source: This behavior is communicated by a getter and setter in the same way as for computed properties:
ja: この挙動は、計算プロパティに関してと同様に、ゲッターとセッターによって伝えられます：

source: This behavior is different from other types, where a public type definition implies an access level of internal for the type’s members.
ja: この挙動は他の型とは異なります、そこにおいて、公開型定義は、その型のメンバーに対して内部アクセス水準を暗黙的に意味します。

source: This behavior is due to structures being value types.
ja: この挙動は、この構造体が値型であるためです。

source: This behavior is known as copy-in copy-out or call by value result.
ja: この挙動は、コピーイン・コピーアウトまたは結果値による呼び出しとして知られます。

source: This behavior is known as value binding, because the values are bound to temporary constants or variables within the case’s body.
ja: この挙動は値束縛として知られています、なぜなら値がそのケース節の本文内の一時的な定数または変数に束縛（バインド）されるからです。

source: This behavior is referred to as longest match or maximal munch.
ja: この挙動は、最長マッチまたは欲張り捕獲と呼ばれます。

source: This behavior is summarized in the following rules:
ja: この挙動は、以下の規則において要約されます：

source: This behavior means you can use extensions in the same way to organize your code, whether or not your types have private entities.
ja: この挙動は、あなたの型が非公開な実在を持つかどうかにかかわらず、あなたが拡張を同じ方法で使ってあなたのコードを編成できるのを意味します。

source: This behavior prevents the reference from becoming part of a strong reference cycle.
ja: この挙動は、参照が強い参照循環の一部になるのを妨げます。

source: This behavior removes the need for the array bounds check seen in the while loop version of the game described earlier.
ja: この挙動は、前に記述されたwhileループ版のゲームで見られた配列の境界検査の必要を取り除きます。

source: This book describes Swift 5.2, the default version of Swift that’s included in Xcode 11.4.
ja: この本はSwift 5.2、Xcode 11.4に含まれるスウィフトの初期状態のバージョン、を記述します。

source: This calculation yields the final answer of 17.
ja: この計算は、最終的な答えの17を生みます。
